In [1]:
!source ./ashu-env/bin/activate

In [2]:
# importing python pandas 
import pandas as pd

In [3]:
# creating dataframe
ashu_data = {
    'name' : ['ashu','luis','jack'],
    'age':  [27,35,30],
    'city': ['New York','Los Angeles','chicago']
}

df = pd.DataFrame(ashu_data)
print(df)

   name  age         city
0  ashu   27     New York
1  luis   35  Los Angeles
2  jack   30      chicago

In [4]:
# basic Operations 
print(df.head())

   name  age         city
0  ashu   27     New York
1  luis   35  Los Angeles
2  jack   30      chicago

In [5]:
# selecting columns 
df['name']

0    ashu
1    luis
2    jack
Name: name, dtype: object

In [6]:
# multiple columns 
df[['name','age']]

   name  age
0  ashu   27
1  luis   35
2  jack   30

In [8]:
df[df['age'] > 30 ]

   name  age         city
1  luis   35  Los Angeles

In [9]:
# adding column 
df['salary'] =  [80000,65000,70000]
df

   name  age         city  salary
0  ashu   27     New York   80000
1  luis   35  Los Angeles   65000
2  jack   30      chicago   70000

In [10]:
# groupby 
df.groupby('city')['age'].mean()

city
Los Angeles    35.0
New York       27.0
chicago        30.0
Name: age, dtype: float64